NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG24/EFR32MG24A010F1536GM48.svd
        <register>
          <name>IEN</name>
          <description>Interrupt Enables</description>
          <addressOffset>0x020</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>NOKEY</name>
              <description>No Key was pressed</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KEY</name>
              <description>A Key was pressed </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCANNED</name>
              <description>Completed Scanning</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUP</name>
              <description>Wake up</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DMEM_S</name>
      <version>2</version>
      <description>DMEM_S Registers</description>
      <baseAddress>0x400B4000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IPVERSION</name>
          <description>No Description</description>
          <addressOffset>0x000</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>IPVERSION</name>
              <description>New BitField</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>No Description</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>CLEARECCADDR0</name>
              <description>Clear ECCERRADDR0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLEARECCADDR1</name>
              <description>Clear ECCERRADDR1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLEARECCADDR2</name>
              <description>Clear ECCERRADDR2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLEARECCADDR3</name>
              <description>Clear ECCERRADDR3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>No Description</description>
          <addressOffset>0x008</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000040</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>ECCEN</name>
              <description>Enable ECC functionality</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECCWEN</name>
              <description>Enable ECC syndrome writes</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECCERRFAULTEN</name>
              <description>ECC Error bus fault enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBPORTPRIORITY</name>
              <description>AHB port arbitration priority</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No AHB port have raised priority.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT0</name>
                  <description>AHB port 0 has raised priority.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT1</name>
                  <description>AHB port 1 has raised priority.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT2</name>
                  <description>AHB port 2 has raised priority.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT3</name>
                  <description>AHB port 3 has raised priority.</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDRFAULTEN</name>
              <description>Address fault bus fault enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAITSTATES</name>
              <description>RAM read wait states</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCERRADDR0</name>
          <description>No Description</description>
          <addressOffset>0x00C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>ECC Error Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCERRADDR1</name>
          <description>No Description</description>
          <addressOffset>0x010</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>ECC Error Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCERRADDR2</name>
          <description>No Description</description>
          <addressOffset>0x014</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>ECC Error Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCERRADDR3</name>
          <description>No Description</description>
          <addressOffset>0x018</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>ECC Error Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCMERRIND</name>
          <description>No Description</description>
          <addressOffset>0x01C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>P0</name>
              <description>Multiple ECC errors on AHB port 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P1</name>
              <description>Multiple ECC errors on AHB port 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P2</name>
              <description>Multiple ECC errors on AHB port 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P3</name>
              <description>Multiple ECC errors on AHB port 2</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>No Description</description>
          <addressOffset>0x020</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>AHB0ERR1B</name>
              <description>AHB0 1-bit ECC Error Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB1ERR1B</name>
              <description>AHB1 1-bit ECC Error Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB2ERR1B</name>
              <description>AHB2 1-bit ECC Error Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB3ERR1B</name>
              <description>AHB3 1-bit ECC Error Interrupt Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB0ERR2B</name>
              <description>AHB0 2-bit ECC Error Interrupt Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB1ERR2B</name>
              <description>AHB1 2-bit ECC Error Interrupt Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB2ERR2B</name>
              <description>AHB2 2-bit ECC Error Interrupt Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB3ERR2B</name>
              <description>AHB3 2-bit ECC Error Interrupt Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEN</name>
          <description>No Description</description>
          <addressOffset>0x024</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>AHB0ERR1B</name>
              <description>AHB0 1-bit ECC Error Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB1ERR1B</name>
              <description>AHB1 1-bit ECC Error Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB2ERR1B</name>
              <description>AHB2 1-bit ECC Error Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB3ERR1B</name>
              <description>AHB3 1-bit ECC Error Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB0ERR2B</name>
              <description>AHB0 2-bit ECC Error Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB1ERR2B</name>
              <description>AHB1 2-bit ECC Error Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB2ERR2B</name>
              <description>AHB2 2-bit ECC Error Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB3ERR2B</name>
              <description>AHB3 2-bit ECC Error Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RAMBANKSVALID</name>
          <description>No Description</description>
          <addressOffset>0x028</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>RAMBANKSVALID</name>
              <description>Enable bits for RAM banks 0-31</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLK0</name>
                  <description>Enable RAM block0 </description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK0TO1</name>
                  <description>Enable RAM block0 to block1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK0TO2</name>
                  <description>Enable RAM block0 to block2</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK0TO3</name>
                  <description>Enable RAM block0 to block3</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK0TO4</name>
                  <description>Enable RAM block0 to block4</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK0TO5</name>
                  <description>Enable RAM block0 to block5</description>
                  <value>63</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK0TO6</name>
                  <description>Enable RAM block0 to block6</description>
                  <value>127</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK0TO7</name>
                  <description>Enable RAM block0 to block7</description>
                  <value>255</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK0TO8</name>
                  <description>Enable RAM block0 to block8</description>
                  <value>511</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK0TO9</name>
                  <description>Enable RAM block0 to block9</description>
                  <value>1023</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK0TO10</name>
                  <description>Enable RAM block0 to block10</description>
                  <value>2047</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK0TO11</name>
                  <description>Enable RAM block0 to block11</description>
                  <value>4095</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK0TO12</name>
                  <description>Enable RAM block0 to block12</description>
                  <value>8191</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK0TO13</name>
                  <description>Enable RAM block0 to block13</description>
                  <value>16383</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK0TO14</name>
                  <description>Enable RAM block0 to block14</description>
                  <value>32767</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK0TO15</name>
                  <description>Enable RAM block0 to block15</description>
                  <value>65535</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGSRTOP</name>
          <description>No Description</description>
          <addressOffset>0x02C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>SRTOP</name>
              <description>Sequential region on top</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGSRMAP</name>
          <description>No Description</description>
          <addressOffset>0x030</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>MAP</name>
              <description></description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGIU0MAP</name>
          <description>No Description</description>
          <addressOffset>0x034</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>MAP</name>
              <description></description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGIU1MAP</name>
          <description>No Description</description>
          <addressOffset>0x038</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>MAP</name>
              <description></description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGIU2MAP</name>
          <description>No Description</description>
          <addressOffset>0x03C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>MAP</name>
              <description></description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGIU3MAP</name>
          <description>No Description</description>
          <addressOffset>0x040</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>MAP</name>
              <description></description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
