NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG24/EFR32MG24A010F1536GM48.svd
        <register>
          <name>INSTR7CFG2</name>
          <description>Instruction N word 2</description>
          <addressOffset>0x170</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x9FF0FFFF</resetMask>
          <fields>
            <field>
              <name>LOOP0BEGIN</name>
              <description>Loop Begin</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOP0END</name>
              <description>Loop End</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOP1BEGIN</name>
              <description>Loop Begin</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOP1END</name>
              <description>Loop End</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOP2BEGIN</name>
              <description>Loop Begin</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOP2END</name>
              <description>Loop End</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOP3BEGIN</name>
              <description>Loop Begin</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOP3END</name>
              <description>Loop End</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOP4BEGIN</name>
              <description>Loop Begin</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOP4END</name>
              <description>Loop End</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOP5BEGIN</name>
              <description>Loop Begin</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOP5END</name>
              <description>Loop End</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOP6BEGIN</name>
              <description>Loop Begin</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOP6END</name>
              <description>Loop End</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOP7BEGIN</name>
              <description>Loop Begin</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOP7END</name>
              <description>Loop End</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALUOP</name>
              <description>ALU opcode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOOP</name>
                  <description>No Operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Clear register (set to +0)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COPY</name>
                  <description>Copy operation</description>
                  <value>65</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWAP</name>
                  <description>Swap operation</description>
                  <value>66</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBL</name>
                  <description>Double operation (multiply by 2)</description>
                  <value>67</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FANA</name>
                  <description>Load real and imag (form A)</description>
                  <value>68</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FANB</name>
                  <description>Load real and imag (form B)</description>
                  <value>69</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RELU2</name>
                  <description>ReLU of real (max of real and +0)</description>
                  <value>70</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NRELU2</name>
                  <description>Min of real and -0</description>
                  <value>71</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC2</name>
                  <description>Increment by 1.0</description>
                  <value>72</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEC2</name>
                  <description>Decrement by 1.0</description>
                  <value>73</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDR</name>
                  <description>Addition of 2 reals</description>
                  <value>74</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAX</name>
                  <description>Maximum of 2 reals</description>
                  <value>75</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MIN</name>
                  <description>Minimum of 2 reals</description>
                  <value>76</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSQR2B</name>
                  <description>Square of real (form B)</description>
                  <value>292</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDC</name>
                  <description>Add Complex</description>
                  <value>334</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAX2A</name>
                  <description>Max of reals (form A)</description>
                  <value>339</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MIN2A</name>
                  <description>Min of reals (form A)</description>
                  <value>340</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XREALC2</name>
                  <description>Extract real from complex</description>
                  <value>350</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XIMAGC2</name>
                  <description>Extract imag from complex</description>
                  <value>351</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDR2B</name>
                  <description>Add reals (form B)</description>
                  <value>353</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAX2B</name>
                  <description>Max of reals (form B)</description>
                  <value>354</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MIN2B</name>
                  <description>Min of reals (form B)</description>
                  <value>355</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULC</name>
                  <description>Multiply Complex</description>
                  <value>397</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULR2A</name>
                  <description>Multiply reals (form A)</description>
                  <value>407</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULR2B</name>
                  <description>Multiply reals (form B)</description>
                  <value>408</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDR4</name>
                  <description>Add 4 reals</description>
                  <value>410</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAX4</name>
                  <description>Max of 4 reals</description>
                  <value>411</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MIN4</name>
                  <description>Min of 4 reals</description>
                  <value>412</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SQRMAGC2</name>
                  <description>Squared magnitude Complex</description>
                  <value>413</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRELU2B</name>
                  <description>Parametric ReLU (form B)</description>
                  <value>416</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MACC</name>
                  <description>Multiply Accumulate Complex</description>
                  <value>461</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AACC</name>
                  <description>Add Accumulate Complex</description>
                  <value>462</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ELU2A</name>
                  <description>part of ELU activation (form A)</description>
                  <value>463</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ELU2B</name>
                  <description>part of ELU activation (form B)</description>
                  <value>464</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IFR2A</name>
                  <description>If A then X else Y (form A)</description>
                  <value>465</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IFR2B</name>
                  <description>If A then X else Y (form B)</description>
                  <value>466</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXAC2</name>
                  <description>Max of reals and accumulator</description>
                  <value>467</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINAC2</name>
                  <description>Min of reals and accumulators</description>
                  <value>468</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLIP2A</name>
                  <description>Clipping activation (form A)</description>
                  <value>469</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLIP2B</name>
                  <description>Clipping activation (form B)</description>
                  <value>470</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MACR2A</name>
                  <description>Multiply accumulate reals (form A)</description>
                  <value>471</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MACR2B</name>
                  <description>Multiply accumulate reals (form B)</description>
                  <value>472</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IFC</name>
                  <description>If A then X else Y (complex)</description>
                  <value>473</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENDPROG</name>
              <description>End of Program</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>Command Register</description>
          <addressOffset>0x174</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>START</name>
              <description>Start Command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HALT</name>
              <description>Halt Command</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>STEP</name>
              <description>Step Command</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INIT</name>
              <description>Initialization Command/Qualifier</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUGEN</name>
          <description>Debug Control Register</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7003FDFE</resetMask>
          <fields>
            <field>
              <name>BKPTLOOP0DONE</name>
              <description>Enable Breakpoint on Loop Done</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BKPTLOOP1DONE</name>
              <description>Enable Breakpoint on Loop Done</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BKPTLOOP2DONE</name>
              <description>Enable Breakpoint on Loop Done</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BKPTLOOP3DONE</name>
              <description>Enable Breakpoint on Loop Done</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BKPTLOOP4DONE</name>
              <description>Enable Breakpoint on Loop Done</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BKPTLOOP5DONE</name>
              <description>Enable Breakpoint on Loop Done</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BKPTLOOP6DONE</name>
              <description>Enable Breakpoint on Loop Done</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BKPTLOOP7DONE</name>
              <description>Enable Breakpoint on Loop Done</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BKPTALUNAN</name>
              <description>Enable Breakpoint on ALUNAN</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BKPTR0POSREAL</name>
              <description>Enable Breakpoint on R0POSREAL</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BKPTALUOF</name>
              <description>Enable Breakpoint on ALUOF</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BKPTALUUF</name>
              <description>Enable Breakpoint on ALUUF</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BKPTSTORECONVERTOF</name>
              <description>Enable Breakpoint on STORECONVERTOF</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BKPTSTORECONVERTUF</name>
              <description>Enable Breakpoint on STORECONVERTUF</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BKPTSTORECONVERTINF</name>
              <description>Enable Breakpoint on STORECONVERTINF</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BKPTSTORECONVERTNAN</name>
              <description>Enable Breakpoint on STORECONVERTNAN</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEBUGSTEPCNTEN</name>
              <description>Debug Step Count Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEBUGBKPTALLEN</name>
              <description>Trigger Breakpoint  when ALL conditions match</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEBUGBKPTANYEN</name>
              <description>Enable Breakpoint when ANY conditions match</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUGSTEPCNT</name>
          <description>No Description</description>
          <addressOffset>0x204</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>DEBUGSTEPCNT</name>
              <description>Debug Step Counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
